Python 3.11.5 (tags/v3.11.5:cce6ba9, Aug 24 2023, 14:38:34) [MSC v.1936 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

= RESTART: C:/Users/lucia/OneDrive/바탕 화면/오픈소스프로그래밍_1102_실습문제.py

========= RESTART: C:/Users/lucia/OneDrive/바탕 화면/오픈소스프로그래밍_1102_실습문제.py ========
[79, 86, 90, 96]
[79, 86, 90, 96, 96, 96, 96]
[79, 86, 90, 96, 96, 96, 96, 96, 96, 96, 96]
[79, 86, 90, 96, 96, 96, 96, 96, 96, 96, 96, 96, 96]

======================= RESTART: C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py ======================
[['홍길동', 79, 86, 90, 96], ['나소웨', 93, 89, 96], ['이대한', 95, 89, 91, 93], ['오서경', 81, 96]]
[['홍길동', 79, 86, 90, 96, 175.5], ['나소웨', 93, 89, 96, 185.33333333333334], ['이대한', 95, 89, 91, 93, 184.0], ['오서경', 81, 96, 177.0]]


홍길동 => 평균: 175.500000 최고점수: (5학년) 175
나소웨 => 평균: 185.333333 최고점수: (4학년) 185
이대한 => 평균: 184.000000 최고점수: (5학년) 184
오서경 => 평균: 177.000000 최고점수: (3학년) 177

======================= RESTART: C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py ======================
[['홍길동', 79, 86, 90, 96], ['나소웨', 93, 89, 96], ['이대한', 95, 89, 91, 93], ['오서경', 81, 96]]
[['홍길동', 79, 86, 90, 96, 175.5], ['나소웨', 93, 89, 96, 185.33333333333334], ['이대한', 95, 89, 91, 93, 184.0], ['오서경', 81, 96, 177.0]]


홍길동 => 평균: 175.50 최고점수: (5학년) 175
나소웨 => 평균: 185.33 최고점수: (4학년) 185
이대한 => 평균: 184.00 최고점수: (5학년) 184
오서경 => 평균: 177.00 최고점수: (3학년) 177

======================= RESTART: C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py ======================
[['홍길동', 79, 86, 90, 96], ['나소웨', 93, 89, 96], ['이대한', 95, 89, 91, 93], ['오서경', 81, 96]]
[['홍길동', 79, 86, 90, 96, 175.5], ['나소웨', 93, 89, 96, 185.33333333333334], ['이대한', 95, 89, 91, 93, 184.0], ['오서경', 81, 96, 177.0]]


Traceback (most recent call last):
  File "C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py", line 28, in <module>
    print_get_max(scoreTbl)
  File "C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py", line 20, in print_get_max
    print("%s => 평균: %.2f 최고점수: (%d학년) %d"%(std[0], std[-1], std.index(mx-1), mx))
ValueError: 174.5 is not in list
>>> 
======================= RESTART: C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py ======================
[['홍길동', 79, 86, 90, 96], ['나소웨', 93, 89, 96], ['이대한', 95, 89, 91, 93], ['오서경', 81, 96]]
[['홍길동', 79, 86, 90, 96, 175.5], ['나소웨', 93, 89, 96, 185.33333333333334], ['이대한', 95, 89, 91, 93, 184.0], ['오서경', 81, 96, 177.0]]


홍길동 => 평균: 175.50 최고점수: (4학년) 175
나소웨 => 평균: 185.33 최고점수: (3학년) 185
이대한 => 평균: 184.00 최고점수: (4학년) 184
오서경 => 평균: 177.00 최고점수: (2학년) 177
>>> 
======================= RESTART: C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py ======================
[['홍길동', 79, 86, 90, 96], ['나소웨', 93, 89, 96], ['이대한', 95, 89, 91, 93], ['오서경', 81, 96]]
[['홍길동', 79, 86, 90, 96, 175.5], ['나소웨', 93, 89, 96, 185.33333333333334], ['이대한', 95, 89, 91, 93, 184.0], ['오서경', 81, 96, 177.0]]


홍길동 => 평균: 175.50 최고점수: (4학년) 96
나소웨 => 평균: 185.33 최고점수: (3학년) 96
이대한 => 평균: 184.00 최고점수: (1학년) 95
오서경 => 평균: 177.00 최고점수: (2학년) 96
>>> 
======================= RESTART: C:/Users/lucia/OneDrive/바탕 화면/midterm_1.py ======================
[['홍길동', 79, 86, 90, 96], ['나소웨', 93, 89, 96], ['이대한', 95, 89, 91, 93], ['오서경', 81, 96]]
[['홍길동', 79, 86, 90, 96, 87.75], ['나소웨', 93, 89, 96, 92.66666666666667], ['이대한', 95, 89, 91, 93, 92.0], ['오서경', 81, 96, 88.5]]


홍길동 => 평균: 87.75 최고점수: (4학년) 96
나소웨 => 평균: 92.67 최고점수: (3학년) 96
이대한 => 평균: 92.00 최고점수: (1학년) 95
오서경 => 평균: 88.50 최고점수: (2학년) 96
